In [23]:
gender.char <- sample(c('female', 'male'), 1000, replace=TRUE)
object.size(gender.char)

8160 bytes

In [25]:
gender.fac <- factor(gender.char)
object.size(gender.fac)

4560 bytes

In [27]:
# Create a dataframe object
employee.df<- data.frame(
  id = 1001:1007,
  name = c("Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"), # Names
  department = c("HR", "IT", "Finance", "Marketing", "Sales", "Admin", "IT"), # Departments
  gender = c("F", "M", "M", "M", "F", "M", "F"),  # Gender
  type = c("Full-time", "Contract", "Full-time", "Contract", "Full-time", "Contract", "Full-time"), # Employment type
  salary = c(50000, 60000, 55000, 30000, 70000, 40000, 75000) # Salaries
)

# Print the dataframe
print(employee.df)

    id    name department gender      type salary
1 1001   Alice         HR      F Full-time  50000
2 1002     Bob         IT      M  Contract  60000
3 1003 Charlie    Finance      M Full-time  55000
4 1004   David  Marketing      M  Contract  30000
5 1005     Eva      Sales      F Full-time  70000
6 1006   Frank      Admin      M  Contract  40000
7 1007   Grace         IT      F Full-time  75000

In [29]:
employee.df

  id   name    department gender type      salary
1 1001 Alice   HR         F      Full-time 50000
2 1002 Bob     IT         M      Contract  60000
3 1003 Charlie Finance    M      Full-time 55000
4 1004 David   Marketing  M      Contract  30000
5 1005 Eva     Sales      F      Full-time 70000
6 1006 Frank   Admin      M      Contract  40000
7 1007 Grace   IT         F      Full-time 75000

In [31]:
class(employee.df$department)

[1] "factor"

In [33]:
summary(employee.df)

       id            name       department gender        type       salary
 Min.   :1001   Alice  :1   Admin    :1    F:3    Contract :3   Min.   :30000
 1st Qu.:1002   Bob    :1   Finance  :1    M:4    Full-time:4   1st Qu.:45000
 Median :1004   Charlie:1   HR       :1                         Median :55000
 Mean   :1004   David  :1   IT       :2                         Mean   :54286
 3rd Qu.:1006   Eva    :1   Marketing:1                         3rd Qu.:65000
 Max.   :1007   Frank  :1   Sales    :1                         Max.   :75000
                Grace  :1

In [35]:
str(employee.df)

'data.frame':	7 obs. of  6 variables:
 $ id        : int  1001 1002 1003 1004 1005 1006 1007
 $ name      : Factor w/ 7 levels "Alice","Bob",..: 1 2 3 4 5 6 7
 $ department: Factor w/ 6 levels "Admin","Finance",..: 3 4 2 5 6 1 4
 $ gender    : Factor w/ 2 levels "F","M": 1 2 2 2 1 2 1
 $ type      : Factor w/ 2 levels "Contract","Full-time": 2 1 2 1 2 1 2
 $ salary    : num  50000 60000 55000 30000 70000 40000 75000

In [37]:
employee.df$department

[1] HR        IT        Finance   Marketing Sales     Admin     IT
Levels: Admin Finance HR IT Marketing Sales

In [39]:
employee.df<- data.frame(
  id = 1001:1007,
  name = c("Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"), 
  department = c("HR", "IT", "Finance", "Marketing", "Sales", "Admin", "IT"),
  gender = c("F", "M", "M", "M", "F", "M", "F"),  # Gender
  type = c("Full-time", "Contract", "Full-time", "Contract", "Full-time", "Contract", "Full-time"), 
  salary = c(50000, 60000, 55000, 30000, 70000, 40000, 75000),
  stringsAsFactors = FALSE
)
employee.df

  id   name    department gender type      salary
1 1001 Alice   HR         F      Full-time 50000
2 1002 Bob     IT         M      Contract  60000
3 1003 Charlie Finance    M      Full-time 55000
4 1004 David   Marketing  M      Contract  30000
5 1005 Eva     Sales      F      Full-time 70000
6 1006 Frank   Admin      M      Contract  40000
7 1007 Grace   IT         F      Full-time 75000

In [41]:
str(employee.df)

'data.frame':	7 obs. of  6 variables:
 $ id        : int  1001 1002 1003 1004 1005 1006 1007
 $ name      : chr  "Alice" "Bob" "Charlie" "David" ...
 $ department: chr  "HR" "IT" "Finance" "Marketing" ...
 $ gender    : chr  "F" "M" "M" "M" ...
 $ type      : chr  "Full-time" "Contract" "Full-time" "Contract" ...
 $ salary    : num  50000 60000 55000 30000 70000 40000 75000

In [43]:
employee.df$department

[1] "HR"        "IT"        "Finance"   "Marketing" "Sales"     "Admin"
[7] "IT"

In [49]:
employee.df.subset = employee.df[employee.df$department == 'HR' | 
                                 employee.df$department == 'IT' | 
                                 employee.df$department == 'Sales',
                                ]
employee.df.subset

  id   name  department gender type      salary
1 1001 Alice HR         F      Full-time 50000
2 1002 Bob   IT         M      Contract  60000
5 1005 Eva   Sales      F      Full-time 70000
7 1007 Grace IT         F      Full-time 75000

In [51]:
unique(employee.df.subset$type)

[1] "Full-time" "Contract"

In [55]:
bug.priority <- sample(c('low', 'medium', 'high', 'urgent'), 50, replace = TRUE)
print(bug.priority)

 [1] "urgent" "medium" "medium" "urgent" "low"    "low"    "low"    "low"
 [9] "urgent" "high"   "high"   "medium" "high"   "medium" "medium" "low"
[17] "high"   "urgent" "medium" "medium" "high"   "low"    "urgent" "urgent"
[25] "medium" "high"   "medium" "medium" "high"   "medium" "high"   "urgent"
[33] "urgent" "urgent" "low"    "high"   "high"   "low"    "low"    "high"
[41] "medium" "urgent" "urgent" "urgent" "high"   "low"    "medium" "medium"
[49] "urgent" "low"

In [59]:
bug.priority.factor <- factor(bug.priority)
levels(bug.priority.factor)

[1] "high"   "low"    "medium" "urgent"

In [65]:
bug.priority.factor <- ordered(bug.priority, levels=c('low','medium', 'high', 'urgent'))
levels(bug.priority.factor)

[1] "low"    "medium" "high"   "urgent"

In [67]:
bug.priority.factor

 [1] urgent medium medium urgent low    low    low    low    urgent high
[11] high   medium high   medium medium low    high   urgent medium medium
[21] high   low    urgent urgent medium high   medium medium high   medium
[31] high   urgent urgent urgent low    high   high   low    low    high
[41] medium urgent urgent urgent high   low    medium medium urgent low
Levels: low < medium < high < urgent

In [75]:
tapply(employee.df$salary, employee.df$department, mean) #similar to SQL group by query

    Admin   Finance        HR        IT Marketing     Sales
    40000     55000     50000     67500     30000     70000

In [77]:
tapply(employee.df$salary, employee.df$type, max)

 Contract Full-time
    60000     75000

In [81]:
tapply(employee.df$salary, list(employee.df$gender, employee.df$type), median)

  Contract Full-time
F    NA    70000
M 40000    55000

In [83]:
split(employee.df, employee.df$department)

$Admin
    id  name department gender     type salary
6 1006 Frank      Admin      M Contract  40000

$Finance
    id    name department gender      type salary
3 1003 Charlie    Finance      M Full-time  55000

$HR
    id  name department gender      type salary
1 1001 Alice         HR      F Full-time  50000

$IT
    id  name department gender      type salary
2 1002   Bob         IT      M  Contract  60000
7 1007 Grace         IT      F Full-time  75000

$Marketing
    id  name department gender     type salary
4 1004 David  Marketing      M Contract  30000

$Sales
    id name department gender      type salary
5 1005  Eva      Sales      F Full-time  70000

In [85]:
split(employee.df, employee.df$gender)

$F
    id  name department gender      type salary
1 1001 Alice         HR      F Full-time  50000
5 1005   Eva      Sales      F Full-time  70000
7 1007 Grace         IT      F Full-time  75000

$M
    id    name department gender      type salary
2 1002     Bob         IT      M  Contract  60000
3 1003 Charlie    Finance      M Full-time  55000
4 1004   David  Marketing      M  Contract  30000
6 1006   Frank      Admin      M  Contract  40000

In [87]:
split(employee.df, employee.df$type)

$Contract
    id  name department gender     type salary
2 1002   Bob         IT      M Contract  60000
4 1004 David  Marketing      M Contract  30000
6 1006 Frank      Admin      M Contract  40000

$`Full-time`
    id    name department gender      type salary
1 1001   Alice         HR      F Full-time  50000
3 1003 Charlie    Finance      M Full-time  55000
5 1005     Eva      Sales      F Full-time  70000
7 1007   Grace         IT      F Full-time  75000

In [95]:
courses <- c('Java', 'Python', 'C#', 'R', 'SQL', 'Java', 'Python', 'C#', 'R', 'SQL', 'Java', 'Python', 'C#', 'R', 'SQL',
            'Java', 'Python', 'Python', 'R', 'Java', 'C#', 'R')
print(courses)

 [1] "Java"   "Python" "C#"     "R"      "SQL"    "Java"   "Python" "C#"
 [9] "R"      "SQL"    "Java"   "Python" "C#"     "R"      "SQL"    "Java"
[17] "Python" "Python" "R"      "Java"   "C#"     "R"

In [97]:
courses.table <- table(courses)
courses.table

courses
    C#   Java Python      R    SQL
     4      5      5      5      3

In [99]:
class(courses.table)

[1] "table"

In [101]:
length(courses)

[1] 22